; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p13---int100n150-m25---int100c150---s222---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 - fuellevel
)

(:init
(sum level0 level8 level8)
(sum level0 level17 level17)
(sum level0 level23 level23)
(sum level1 level8 level9)
(sum level1 level17 level18)
(sum level1 level23 level24)
(sum level2 level8 level10)
(sum level2 level17 level19)
(sum level2 level23 level25)
(sum level3 level8 level11)
(sum level3 level17 level20)
(sum level3 level23 level26)
(sum level4 level8 level12)
(sum level4 level17 level21)
(sum level4 level23 level27)
(sum level5 level8 level13)
(sum level5 level17 level22)
(sum level5 level23 level28)
(sum level6 level8 level14)
(sum level6 level17 level23)
(sum level6 level23 level29)
(sum level7 level8 level15)
(sum level7 level17 level24)
(sum level7 level23 level30)
(sum level8 level8 level16)
(sum level8 level17 level25)
(sum level8 level23 level31)
(sum level9 level8 level17)
(sum level9 level17 level26)
(sum level9 level23 level32)
(sum level10 level8 level18)
(sum level10 level17 level27)
(sum level10 level23 level33)
(sum level11 level8 level19)
(sum level11 level17 level28)
(sum level11 level23 level34)
(sum level12 level8 level20)
(sum level12 level17 level29)
(sum level12 level23 level35)
(sum level13 level8 level21)
(sum level13 level17 level30)
(sum level13 level23 level36)
(sum level14 level8 level22)
(sum level14 level17 level31)
(sum level14 level23 level37)
(sum level15 level8 level23)
(sum level15 level17 level32)
(sum level15 level23 level38)
(sum level16 level8 level24)
(sum level16 level17 level33)
(sum level16 level23 level39)
(sum level17 level8 level25)
(sum level17 level17 level34)
(sum level17 level23 level40)
(sum level18 level8 level26)
(sum level18 level17 level35)
(sum level18 level23 level41)
(sum level19 level8 level27)
(sum level19 level17 level36)
(sum level19 level23 level42)
(sum level20 level8 level28)
(sum level20 level17 level37)
(sum level20 level23 level43)
(sum level21 level8 level29)
(sum level21 level17 level38)
(sum level21 level23 level44)
(sum level22 level8 level30)
(sum level22 level17 level39)
(sum level22 level23 level45)
(sum level23 level8 level31)
(sum level23 level17 level40)
(sum level23 level23 level46)
(sum level24 level8 level32)
(sum level24 level17 level41)
(sum level24 level23 level47)
(sum level25 level8 level33)
(sum level25 level17 level42)
(sum level25 level23 level48)
(sum level26 level8 level34)
(sum level26 level17 level43)
(sum level26 level23 level49)
(sum level27 level8 level35)
(sum level27 level17 level44)
(sum level27 level23 level50)
(sum level28 level8 level36)
(sum level28 level17 level45)
(sum level28 level23 level51)
(sum level29 level8 level37)
(sum level29 level17 level46)
(sum level29 level23 level52)
(sum level30 level8 level38)
(sum level30 level17 level47)
(sum level30 level23 level53)
(sum level31 level8 level39)
(sum level31 level17 level48)
(sum level31 level23 level54)
(sum level32 level8 level40)
(sum level32 level17 level49)
(sum level32 level23 level55)
(sum level33 level8 level41)
(sum level33 level17 level50)
(sum level33 level23 level56)
(sum level34 level8 level42)
(sum level34 level17 level51)
(sum level34 level23 level57)
(sum level35 level8 level43)
(sum level35 level17 level52)
(sum level35 level23 level58)
(sum level36 level8 level44)
(sum level36 level17 level53)
(sum level36 level23 level59)
(sum level37 level8 level45)
(sum level37 level17 level54)
(sum level37 level23 level60)
(sum level38 level8 level46)
(sum level38 level17 level55)
(sum level38 level23 level61)
(sum level39 level8 level47)
(sum level39 level17 level56)
(sum level39 level23 level62)
(sum level40 level8 level48)
(sum level40 level17 level57)
(sum level40 level23 level63)
(sum level41 level8 level49)
(sum level41 level17 level58)
(sum level42 level8 level50)
(sum level42 level17 level59)
(sum level43 level8 level51)
(sum level43 level17 level60)
(sum level44 level8 level52)
(sum level44 level17 level61)
(sum level45 level8 level53)
(sum level45 level17 level62)
(sum level46 level8 level54)
(sum level46 level17 level63)
(sum level47 level8 level55)
(sum level48 level8 level56)
(sum level49 level8 level57)
(sum level50 level8 level58)
(sum level51 level8 level59)
(sum level52 level8 level60)
(sum level53 level8 level61)
(sum level54 level8 level62)
(sum level55 level8 level63)

(connected l0 l1)
(fuelcost level23 l0 l1)
(connected l0 l2)
(fuelcost level17 l0 l2)
(connected l1 l0)
(fuelcost level23 l1 l0)
(connected l1 l2)
(fuelcost level8 l1 l2)
(connected l2 l0)
(fuelcost level17 l2 l0)
(connected l2 l1)
(fuelcost level8 l2 l1)

(at t0 l1)
(fuel t0 level63)
(= (total-cost) 0)

(at p0 l0)
(at p1 l1)
(at p2 l1)
(at p3 l2)
(at p4 l0)
(at p5 l1)
(at p6 l2)
(at p7 l1)
(at p8 l1)
(at p9 l2)
(at p10 l2)
(at p11 l1)
(at p12 l1)
)

(:goal
(and
(at p0 l2)
(at p1 l2)
(at p2 l0)
(at p3 l0)
(at p4 l2)
(at p5 l0)
(at p6 l0)
(at p7 l2)
(at p8 l2)
(at p9 l0)
(at p10 l0)
(at p11 l2)
(at p12 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 0 of 13
2. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 0 of 13
3. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 0 of 13
4. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 13
5. (load p12 t0 l1)
   deleted: (at p12 l1)
   added: (in p12 t0)
   goals met: 0 of 13
6. (load p11 t0 l1)
   deleted: (at p11 l1)
   added: (in p11 t0)
   goals met: 0 of 13
7. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 13
8. (drive t0 l1 l2 level55 level8 level63)
   deleted: (at t0 l1) (fuel t0 level63)
   added: (at t0 l2) (fuel t0 level55)
   goals met: 0 of 13
9. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 1 of 13
10. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 2 of 13
11. (unload p11 t0 l2)
   deleted: (in p11 t0)
   added: (at p11 l2)
   goals met: 3 of 13
12. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 4 of 13
13. (load p9 t0 l2)
   deleted: (at p9 l2)
   added: (in p9 t0)
   goals met: 4 of 13
14. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 4 of 13
15. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 4 of 13
16. (load p10 t0 l2)
   deleted: (at p10 l2)
   added: (in p10 t0)
   goals met: 4 of 13
17. (drive t0 l2 l0 level38 level17 level55)
   deleted: (at t0 l2) (fuel t0 level55)
   added: (at t0 l0) (fuel t0 level38)
   goals met: 4 of 13
18. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 4 of 13
19. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 4 of 13
20. (unload p10 t0 l0)
   deleted: (in p10 t0)
   added: (at p10 l0)
   goals met: 5 of 13
21. (unload p12 t0 l0)
   deleted: (in p12 t0)
   added: (at p12 l0)
   goals met: 6 of 13
22. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 7 of 13
23. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 8 of 13
24. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 9 of 13
25. (unload p6 t0 l0)
   deleted: (in p6 t0)
   added: (at p6 l0)
   goals met: 10 of 13
26. (unload p9 t0 l0)
   deleted: (in p9 t0)
   added: (at p9 l0)
   goals met: 11 of 13
27. (drive t0 l0 l2 level21 level17 level38)
   deleted: (at t0 l0) (fuel t0 level38)
   added: (at t0 l2) (fuel t0 level21)
   goals met: 11 of 13
28. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 12 of 13
29. (unload p4 t0 l2)
   deleted: (in p4 t0)
   added: (at p4 l2)
   goals met: 13 of 13
